#pragma once



typedef signed int  int32_t;
/*==============================迷宫创建函数=================================*/
/**
*  \brief 将迷宫数组初始化为迷宫
*
*  
*  
*/
void Creat_laby();

/*==============================迷宫打印函数=================================*/
/**
*  \brief		打印迷宫
*
*  
*  
*/
void Print_laby();

/*==============================迷宫寻址函数=================================*/
/**
*  \brief		输出迷宫路径数组
*
*  \param[in][out]  初始左边  通路情况
*  \retval		size_t 通路为1，死路为0
*/
int Find_path(size_t x, size_t y);

/*==============================路径打印函数=================================*/
/**
*  \brief		打印迷宫路径
*
*
*
*/
void Print_path();

